Revit 2026 API

# ScheduleDefinitionSetFieldOrder Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetFieldOrder(
	IList<ScheduleFieldId> fieldIds
)
```
```vb
Public Sub SetFieldOrder (
	fieldIds As IList(Of ScheduleFieldId)
)
```
```cpp
public:
void SetFieldOrder(
	IList<ScheduleFieldId^>^ fieldIds
)
```
```fsharp
member SetFieldOrder :
        fieldIds : IList<ScheduleFieldId> -> unit
```

#### Parameters

fieldIds IListScheduleFieldId

#### Reference

ScheduleDefinition Class

Autodesk.Revit.DB Namespace